<?php
/**
 * Created by PhpStorm.
 * User: nikitaignatenkov
 * Date: 2019-03-26
 * Time: 20:01
 */

namespace common\models;


use yii\base\Model;

class ProductPriceType extends Model
{

    const SALE = 13;

    public static function getTypes($value)
    {
        $array = [
            1 => '563E116BD306D870E0534301090AFABA',// 2350 Цена закрытой распродажи
            2 => '563E116BD311D870E0534301090AFABA',// 2570 Цена Базовая
            3 => '563E116BD313D870E0534301090AFABA',// 2610 Цена "Со скидкой"
            4 => '563E116BD315D870E0534301090AFABA',// 2650 Цена "Только сегодня"
            5 => '563E116BD31BD870E0534301090AFABA',// 2770 Цена "Распродажа"
            6 => '5E9455C04DB20C75E0538201090A256E',// 2810 Цена для ШикТВ
            7 => '563E116BD31FD870E0534301090AFABA',// 2850 Цена каталога
            8 => '563E116BD321D870E0534301090AFABA',// 2890 Закупочная цена
            9 => '5E9455C04DB30C75E0538201090A256E',// 3010 Аукцион
            10 => '5E9455C04DB40C75E0538201090A256E',// 3020 Находка дня
            11 => '563E116BD328D870E0534301090AFABA',// 3030 Цена каталога N2
            12 => '5E9455C04DB50C75E0538201090A256E',// 3040 Последняя цена
            13 => '5E9455C04DB60C75E0538201090A256E',// 3050 Наша цена
            14 => '5E9455C04DB70C75E0538201090A256E',// 3060 Лучшая цена
            15 => '5E9455C04DB80C75E0538201090A256E',// 3070 Снова в продаже
            16 => '5E9455C04DB90C75E0538201090A256E',// 3080 Бестселлер
            17 => '5E9455C04DBA0C75E0538201090A256E',// 3090 Новинка
            18 => '5E9455C04DBB0C75E0538201090A256E',// 3100 Эксклюзив
            19 => '60EEB1C11B85BE66E0538201090A1D0B',// 3210 Красная цена
            20 => '60EEB1C11B86BE66E0538201090A1D0B',// 3220 Только 1 день
            21 => '60EEB1C11B87BE66E0538201090A1D0B',// 3230 Новогодняя цена
            22 => '60EEB1C11B88BE66E0538201090A1D0B',// 3240 Новогодний хит
            23 => '76EEB19452627D76E0538301090A031D',// 3410 Цена Премьеры
            24 => '84AEEB37B9591BADE0538201090AF598',// 3510 Выгодная цена
            25 => '76EEB19452637D76E0538301090A031D'// 3610 Горящая цена
        ];

        return $value ? array_search($value,$array ) : $array;
    }

}